---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.PipeSettings.SetFlowConvertionServerInfo(Autodesk.Revit.DB.MEPCalculationServerInfo)
source: html/4abe0a72-4d41-3d95-3e5e-aeb7a3d8f639.htm
---
# Autodesk.Revit.DB.Plumbing.PipeSettings.SetFlowConvertionServerInfo Method

Set the MEPServerInfo of the current plumbing flow convertion server.

## Syntax (C#)
```csharp
public void SetFlowConvertionServerInfo(
	MEPCalculationServerInfo serverInfo
)
```

## Parameters
- **serverInfo** (`Autodesk.Revit.DB.MEPCalculationServerInfo`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null